* TODO Previous work on the proper motions and kinematics
:LOGBOOK:
- Note taken on [2024-08-05 Mon 18:34] \\
  Now I have moved it to its own file
- State "TODO"       from              [2024-08-04 Sun 13:32] \\
  I am writing this here just to have somewhere to put it, but maybe move it somewhere else at a later date
:END:
 - Useful discussion on this in [[https://github.com/will-henney/globule-seminario/issues/19][issue #19 on github]]
   
** Summary of our own proper motion measurements
- We find a radial displacement of the knots of about 0.03 arcsec over 11 years (1997-2008)
- And a similar one for the hst-jwst comparison over 14 years (2008-2022)
- [ ] but these are not very precise and I need to do a better job of the quality control
** Proper motion measurements from Marchenko:2010a
- These are based on the outer parts of the nebula and correspond to Δr = 0.0326 ± 0.0059 arcsec over Δt = 11.26 yr
  - This is exactly the same as what we found from the knot expansion
  - They combine this with the radial velocity of 45 km/s to derive a geometric distance of 3.35 ± 0.67 kpc, which is smaller than the parallax distance of 5.429 kpc that we are using
    : 45 5.429 / 3.35 = 73 km/s - consistent with what we got earlier
  - However, this does not take into account the correction for gas speed versus pattern speed, which would be about 15 km/s in the case of the knots (it would be less in the case of the shells though)
  - See the Schoenberner papers, also discussed in [[https://github.com/will-henney/globule-seminario/issues/19#issuecomment-1517063395][a comment on issue #19]]
  - We would need F = 70/45 = 1.56 to get the same distance as the parallax, which is a bit higher than predicted, but not entirely unreasonable, especially given the uncertainties in the proper motions
** Line-of-sight velocities from Zavala:2022a
+ Longslit spectroscopy in Ha and [NII] lines with vertical slits
+ They find a systemic velocity of 170 +/- 10 km/s
  + This seems to be  from the average tangent point velocities around the outer boundary of the main shell
  + All following velocities are relative to this
  + [ ] check the stellar velocity - I think it is a bit different
+ The velocity splitting in the center (close to the star projected position)
  + *their measurement* +/- (46.3 +/- 3.0) km/s
  + *my measurement* +40 km/s to red; -48 km/s to blue
  + 
+ The knot emission seems to be on coherent shells, but mostly smaller radii than the main emission shell
  + Although the velocity splitting is similar, which means that the dynamic age is lower than that of the main shell
  + 
+ The paper includes a model with 3 different nested ellipsoids plus 3 different nested toroids, each with its own Hubble-law velocity profile
  + The velocity gets up to 90 km/s on the long axis of all 3 ellipsoids at their max radii (35, 55, 55 arcsec), but we never see this in the PV diagrams because the long axes are all in the plane of the sky
  + Then they add some extra jet like features, distorsions and localised blow-outs
  + Then they make it clumpy, arbitrarily vary the density of points in different regions (to match imaging observations) and make the redshifted side denser than the blueshifted side (to match the PV diagrams)
  + And it still does not reproduce the observed spectra all that well in detail
    + For instance, it does not show the moderate figure-8 pinching seen in slits D, E, F
    + Predicts some high velocity emission that is not seen
+ The outer halo seems to be very different on the two sides
  - narrow and redshifted +15 km/s in NE (top of slits B, C)
    - but this might be a velocity calibration issue for these slits since the tangent point is also redshifted by the same amount
    - [ ] may also be a similar problem in slit D - we need to bear this in mind if calculating knot velocities (strangely, the theoretical PV image for slit D also seems shifted, but in the opposite direction)
  - narrow and unshifted (+0 km/s) in SW (bottom of slit M)
  - broad and blueshifted (-25 km/s) in S (bottom of slit G) but this might be a jet
* Measurements of clumps in Zavala slits

| Slit |     x |   y |   V |   PA |    r | Group       | Shell |
|------+-------+-----+-----+------+------+-------------+-------|
| D    | -26.8 |  13 |  30 |  64. | 29.8 | E-27        |       |
| D    | -26.8 |   0 |  32 |  90. | 26.8 | E-27        |       |
| D    | -26.8 |  -4 | -18 |  98. | 27.1 | E-27        |       |
| D    | -26.8 | -20 |  34 | 127. | 33.4 | E of S-33 ? |       |
|------+-------+-----+-----+------+------+-------------+-------|
| E    | -18.0 |   8 |  26 |  66. | 19.7 | N of E-20   |       |
| E    | -18.0 |   1 |  33 |  87. | 18.0 | E-20        |       |
| E    | -18.0 |  -4 | -20 | 103. | 18.4 |             |       |
|------+-------+-----+-----+------+------+-------------+-------|
| F    | -11.3 |  15 |  32 |  37. | 18.8 | N of E-20   |       |
| F    | -11.3 |   9 |  35 |  51. | 14.4 | E-13        |       |
| F    | -11.3 |   2 |  36 |  80. | 11.5 | E-13        |       |
| F    | -11.3 |  -4 | -20 | 109. | 12.0 | E-13        |       |
| F    | -11.3 |  -8 |  45 | 125. | 13.8 | E-13        |       |
|------+-------+-----+-----+------+------+-------------+-------|
| G    |  -5.1 |     |     |  90. |  5.1 |             |       |
|------+-------+-----+-----+------+------+-------------+-------|
| H    |   0.0 |  17 |     |  0e0 | 17.0 | N-16        | ?     |
| H    |   0.0 |  10 |     |  0e0 | 10.0 | N-10        | inner |
| H    |   0.0 |   3 |     |  0e0 |  3.0 | NE-04       | inner |
| H    |   0.0 |  -9 |     | 180. |  9.0 | S-07        | inner |
| H    |   0.0 | -13 |     | 180. | 13.0 | S-12        | inner |
| H    |   0.0 | -23 |     | 180. | 23.0 | S-20        | outer |
|------+-------+-----+-----+------+------+-------------+-------|
| I    |   9.4 |  25 |     | 339. | 26.7 | N-27        |       |
| I    |   9.4 |  21 |     | 336. | 23.0 | N-16        |       |
| I    |   9.4 |   4 |     | 293. | 10.2 | NE-04       |       |
| I    |   9.4 |  -3 |     | 252. |  9.9 | W-08        |       |
| I    |   9.4 |  -9 |     | 226. | 13.0 | S-10        |       |
| I    |   9.4 | -18 |     | 208. | 20.3 | S-20        |       |
|------+-------+-----+-----+------+------+-------------+-------|
| J    |  16.5 |  -1 |     | 267. | 16.5 | W-21        |       |
| J    |  16.5 | -15 |     | 228. | 22.3 | S-20 SW-27  |       |
| J    |  16.5 | -23 |     | 216. | 28.3 | SW-27       |       |
|------+-------+-----+-----+------+------+-------------+-------|
| K    |  23.8 |   0 |     | 270. | 23.8 | W-21        |       |
| K    |  23.8 | -12 |     | 243. | 26.7 | SW-27       |       |
#+TBLFM: $5=arctan2(-$2, $3) % 360;f0::$6=sqrt($2**2 + $3**2);f1
** Velocity ellipses in the slits
- From the distribution of "true" radii derived from the ram pressure analysis, it seems that there are at least two shells of knots
  - Inner shell from 15 to 20 arcsec
  - Outer shell from 28 to 34 arcsec
- So we are going to put 3 ellipses at 15, 20, 30 arcsec
- We will assume they all have the same expansion velocity: 40 km/s (subject to revision)
  - Actually, we will try to use the Zavala value of 46.3
  - (275.3 - 254.0) = 21.3 pix is equivalent to 160 km/s
  - So a width of 2 46.3 = 92.6 km/s is equivalent to 21.3 92.6 / 160 = 12.3 pix
  - That turned out to be a bit too large for slit H
- We will use an alternative hypothesis, shown on the [N II] p-v diagrams, that the knot velocity is proportional to R, normalized to 46.3 at R=20
- We can easily calculate the ellipse semi-major axes (V_e, y_e) for a shell of radius R_s and expansion velocity V_s in a slit with displacement x_0
  - V_e = V_s * sqrt(1 - (x_0 / R_s)^2)
  - y_e = R_s * sqrt(1 - (x_0 / R_s)^2)
- Note that (V_e, y_e) involve the same factor. which we will call scale = sqrt(1 - (x_0 / R_s)^2)
| Slit |    x_0 | scale 15 | scale 20 | scale 25 | scale 30 |
|------+-------+----------+----------+----------+----------|
| B    | -41.4 |        0 |        0 |        0 |        0 |
| C    | -34.4 |        0 |        0 |        0 |        0 |
| D    | -26.8 |        0 |        0 |        0 |    0.449 |
| E    | -18.0 |        0 |    0.436 |    0.694 |    0.800 |
| F    | -11.3 |    0.658 |    0.825 |    0.892 |    0.926 |
| G    |  -5.1 |    0.940 |    0.967 |    0.979 |    0.985 |
| H    |   0.0 |    1.000 |    1.000 |    1.000 |    1.000 |
| I    |   9.4 |    0.779 |    0.883 |    0.927 |    0.950 |
| J    |  16.5 |        0 |    0.565 |    0.751 |    0.835 |
| K    |  23.8 |        0 |        0 |    0.306 |    0.609 |
| L    |  32.1 |        0 |        0 |        0 |        0 |
| M    |  41.1 |        0 |        0 |        0 |        0 |
#+TBLFM: $3=abs($2) < 15 ? sqrt(1 - ($2/15)**2):0;f3::$4=abs($2) < 20 ? sqrt(1 - ($2/20)**2):0;f3::$5=abs($2) < 25 ? sqrt(1 - ($2/25)**2):0;f3::$6=abs($2) < 30 ? sqrt(1 - ($2/30)**2):0;f3
** Comments on the groups and slits 
- Some of the slits might need moving slightly in velocity, although I would rather not do this if I can help it
- Some of the original groups are too large, and would be better split up
  - [X] E-13 needs to have NE-13 removed from it
  - [X] ... and we also need to spit off ESE-13 from  the other side since it has different kinematics - blue shifted instead of red shifted 
  - [X] S-20 spans too large a range in PA, should be split into S-25 and SSW-20, which have different kinematics
  - [X] SW-27 to -> SW-27 and SSW-27g
- We also have some new groups that I have identified, although they have no knots yet
  - SE-30, SE-16, NE-20
  - But I have decided to get rid of SE-16, since there is only one knot in it and it is very faint
  - No, now reinstated because I remembered why I put it in the first place - it is a redshited knot below the blueshifted ones
